In [5]:
import numpy as np
import pandas as pd

### Pandas index

In [12]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
obj

a    0
b    1
c    2
dtype: int64

In [13]:
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [14]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [15]:
obj2 = pd.Series([1.5, -2.5, 0.5], index=labels)COLO
obj2

0    1.5
1   -2.5
2    0.5
dtype: float64

In [16]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

### Reindexing

In [17]:
obj = pd.Series([4.5, 7.3, -7.4, 2.], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.3
a   -7.4
c    2.0
dtype: float64

In [18]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -7.4
b    7.3
c    2.0
d    4.5
e    NaN
dtype: float64

### Renaming axis indexes

In [19]:
data = pd.DataFrame(np.arange(12).reshape((3,4)), 
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [21]:
transform = lambda x : x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [22]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [26]:
data

      one  two  three  FO
OHIO    0    1      2   3
COLO    4    5      6   7
NEW     8    9     10  11

In [29]:
# Option 2 is used renameCOLO
data.rename(index={'NEW ':'NY'}, columns={'four':'FO'}, inplace=True)
data

      one  two  three  FO
OHIO    0    1      2   3
NY      4    5      6   7
NY      8    9     10  11

### Hierarchical indexing

In [30]:
data = pd.Series(np.random.randn(9),
                index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'], 
                       [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.631983
   2   -0.317426
   3   -0.896582
b  1   -0.757533
   3   -0.517541
c  1   -0.866430
   2   -0.310400
d  2   -1.222784
   3   -0.414034
dtype: float64

In [31]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [32]:
data['a']

1    0.631983
2   -0.317426
3   -0.896582
dtype: float64

In [35]:
data['b':'c']

b  1   -0.757533
   3   -0.517541
c  1   -0.866430
   2   -0.310400
dtype: float64

In [36]:
data.loc[:, 2]

a   -0.317426
c   -0.310400
d   -1.222784
dtype: float64

In [37]:
data.unstack()

          1         2         3
a  0.631983 -0.317426 -0.896582
b -0.757533       NaN -0.517541
c -0.866430 -0.310400       NaN
d       NaN -1.222784 -0.414034

In [38]:
data.unstack().stack()

a  1    0.631983
   2   -0.317426
   3   -0.896582
b  1   -0.757533
   3   -0.517541
c  1   -0.866430
   2   -0.310400
d  2   -1.222784
   3   -0.414034
dtype: float64

### Hierarchical columns

In [39]:
df = pd.DataFrame(np.arange(12).reshape((4,3)),
                  index=[['a','a','b','b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
df

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [43]:
df['Ohio']

     Green  Red
a 1      0    1
  2      3    4
b 1      6    7
  2      9   10

In [45]:
df['Ohio'].Green.values

array([0, 3, 6, 9])

In [48]:
df.index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [49]:
df.columns

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           )

##### Names of index and columns

In [51]:
df

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [52]:
df.index.names = ['key 1', 'key 2']
df.columns.names = ['state', 'color']
df

state        Ohio     Colorado
color       Green Red    Green
key 1 key 2
a     1         0   1        2
      2         3   4        5
b     1         6   7        8
      2         9  10       11